"""
методы list
"""
list1 = [1, 2, 3]
list1.append(1)  # добавление в конец
# list1 = [1, 2, 3, 1]
list1.extend([5, 5])  # увеличение списка, list1 += [5, 5]
# list1 = [1, 2, 3, 1, 5, 5]
list1.insert(1, 9)  #вставка на позицию
# list1 = [1, 9, 2, 3, 1, 5, 5]
list1.remove(1)  # удаление первого вхождения
# list1 = [9, 2, 3, 1, 5, 5]
list1.pop(0)  # удаление по индексу
# list1 = [2, 3, 1, 5, 5]
number = list1.index(1)  # находит первое вхождение
# number = 2 - тк 2 индекс
number = list1.count(5)  # количество вхождений
# number = 2 - тк 2 пятерки
list1.sort()  # сортировка
# list1 = [1, 2, 3, 5, 5]
list1.reverse()  # переворачивает
# list1 = [5, 5, 3, 2, 1]
list1.clear()  # очищает
print(list1)

